{
  "title": "OPERATIONS ADMINISTRATORS",
  "updated": "Nov 7th 18",
  "position": "Full Time",
  "hours": "35h",
  "location": "TOBAGO AND POS",
  "des": "* Ensures all requests for quotations (i.e. repairs, change out, service etc) are prepared and delivered to the customer in a timely manner\r\n* Liaises regularly with the purchasing/parts department to ensure that the required parts are kept in stock at all times and that non-stock items are sourced in a timely manner\r\n* Assists with the preparation all tender bids and pre-qualification documents; ensures all related documents are provide and deadlines met\r\n* Provides and/or oversees support activities for the department such as answering telephones, review and control of incoming and outgoing correspondence and follow up but not limited to operational commitments to the departments customers.\r\n* Schedules, coordinates and follows up on issues related to meetings etc. for the Service Manager as required\r\n* Prepares and maintains the official minutes and notices of all meetings\r\n* Ensures that follow-up meetings are scheduled to ensure all related documents are provided e.g. quotes, tenders etc\r\n* Prepares special and/or one-time reports, summaries and/or replies to inquiries by selecting relevant data from a variety of sources\r\n* Assists with the coordination/dispatching of all service jobs inclusive of contracts and one-offs in the absence of the Service Coordinator to ensure the timely commencement and completion of same\r\n* Analyzes completed job tickets to ensure all necessary information is recorded\r\n* Follows up on customer requests/complaints as stated on the completed job tickets or through incoming calls\r\n* Researches information, compiles statistics, gathers and computes various data.\r\n* Ensures good customer relationships by attempting to immediately resolve any relative problem that may arise\r\n* Serves as a central point of liaison with other service personnel, departments and external clients in the execution of a variety of service related matters\r\n* Performs a range of diverse administrative activities.\r\n* Prepares reports, summaries or replied to inquires through the selection of relevant data from a variety of sources within and outside of the department’s operations.\r\n* Utilizes knowledge and understanding of underlying operational issues to create, compose and edit technical and/or administrative correspondence and documentation\r\n* Develops and maintains a proper filling system to secure important documents, to ensure easy retrieval of documents and maintain an up-to-date listing of all files and their locations",
  "knowledge": "* General knowledge of the company’s products and services\r\n* Demonstrated time-management skills (multi-task, set priorities and meet strict deadlines)\r\n* Sound organisational, communication and interpersonal skills\r\n* Ability to work independently and in a team-oriented environment\r\n* Ability to problem solve using an array of analytical skills, logic and reasoning to identify and communicate solutions to any issues or problems encountered"
}